app/controllers/book_reviews_controller.rb

SELECT "book_reviews".* FROM "book_reviews"
---
  def index
    @book_reviews = BookReview.all

INSERT INTO "book_reviews" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2021-12-07 08:07:09.387906"], ["updated_at", "2021-12-07 08:07:09.387906"]]
---
  def create
    @book_review = BookReview.new(book_review_params)
    @book_review.user_id = current_user.id
    respond_to do |format|
      if @book_review.save

DELETE FROM "book_reviews" WHERE "book_reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @book_review.destroy

SELECT "book_reviews".* FROM "book_reviews" WHERE "book_reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book_review
      @book_review = BookReview.find(params[:id])