app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "number_of_pages", "created_at", "updated_at", "detail") VALUES (?, ?, ?, ?, ?)  [["title", "book"], ["number_of_pages", 12], ["created_at", "2021-12-07 07:31:29.277414"], ["updated_at", "2021-12-07 07:31:29.277414"], ["detail", "boook inin kakaka"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = ? WHERE "books"."id" = ?  [["updated_at", "2021-12-07 07:31:29.294514"], ["id", 1]]